<script lang="ts">
  export let isShow: boolean = false
</script>

<style>
  .wrap {
    position: relative;
    width: 100%;
    padding: 48px;
    background-color: rgba(0, 0, 0, 0.45);
  }
  .header {
    position: fixed;
    top: 0;
    left: 0;
    width: 100%;
    height: 56px;
    padding: 0 61px;
    background: #212121;
    border-radius: 0;
    opacity: 1;
  }

  .main {
    width: 920px;
    height: 800px;
    margin: 0 auto;
    overflow: hidden;
    margin-bottom: 32px;
    background: #fff;
    border-radius: 2px;
    opacity: 1;
  }
  .con {
    padding: 32px 48px;
    overflow: auto;
    height: calc(100% - 100px);
  }
  h1,
  h2,
  h3,
  h4,
  h5,
  h6 {
    margin-top: 0;
    margin-bottom: 0.5em;
    font-size: 20px;
    font-weight: 500;
    color: rgb(0 0 0 / 85%);
  }
  p {
    margin-top: 0;
    margin-bottom: 1em;
    color: #333840;
  }

  .indent28 {
    text-indent: 28px;
  }

  .indent56 {
    text-indent: 56px;
  }

  .padding56 {
    padding-left: 56px;
  }

  .text-right {
    text-align: right;
  }

  .padding-top-56 {
    padding-top: 56px;
  }
  .title {
    width: calc(100% - 48px);
    height: 86px;
    padding-left: 48px;
    font-size: 20px;
    font-weight: 500;
    line-height: 86px;
    color: #212121;
    opacity: 1;
    border-bottom: 1px solid #ddd;
  }
</style>

<div class="wrap flex flex-justify-center">
  <main class="main flex flex-column flex-align-center">
    <h1 class="title">行者AIGC-用户服务协议</h1>

    <div class="con">
      <p class="indent28">
        本服务协议（以下简称“协议”）是您（以下或称“用户”）与服务提供方（以下称“我们”或“平台”）之间就我们向您提供AIGC相关服务（以下或称“产品”或“服务”，服务内容以我们通过特定平台提供的为准）所达成的服务协议。
      </p>
      <p class="indent28">
        本协议内容同时包括所有我们已发布或未来可能发布的各类规则、公告或通知，且您在使用我们提供的服务时，可能会另有单独的协议、相关服务规则。
        <b>
          前述规则、公告、通知和协议一经发布即为本协议不可分割的组成部分，您同样应当遵守。
        </b>
      </p>
      <p class="indent28">
        您的任何使用行为都将视为您认可本协议，同意接受本协议各项条款的约束，包括接受我们在任何时候对任一条款所作的任何修改。我们有权对本协议包含的条款随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，
        <b>
          如果您不接受修改后的条款，请立即停止使用我们的产品，您继续使用我们提供的产品将被视为您已接受了修改后的协议。
        </b>
        因此，请您务必仔细阅读协议。
      </p>
      <p class="indent28">
        若您是18周岁以下的未成年人，您应在您的监护人监护、指导下并获得监护人同意的情况下，与监护人一并认真阅读并同意本协议的前提下，使用我们的产品和/或服务或向我们提供信息。未成年人用户及其监护人理解并确认，如您违反法律法规、本协议内容，则您及您的监护人应依照法律规定承担因此而可能导致的全部法律责任。
      </p>

      <p class="indent28">
        <b>【特别说明】</b>
      </p>
      <p class="indent28">
        <b>
          为了促进互联网内容健康发展，您在在平台上以及您使用服务的全部行为应符合法律法规底线、社会主义制度底线、国家利益底线、公民合法权益底线、社会公共秩序底线、道德风尚底线、信息真实性底线。
        </b>
      </p>
      <p class="indent28">
        <b>
          请您特别注意，我们向您提供的服务系基于人工智能技术，相关服务/产品生成的所有内容都是由人工智能模型生成，来自于法律法规允许的包括但不限于公开互联网等信息积累以及您提供的图片、文字、声音、视频等信息，并不代表我们的立场或观点。我们无法保证生成内容的准确性、完整性和功能性，也无法保证具有瑕疵、不合理或引发不快的信息或生成内容已经全部过滤，您对使用AIGC服务进行AI创作所生成的内容负有谨慎审核的义务，您应自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的合法性、正确性、完整性或实用性的依赖而产生的风险。如生成内容涉嫌违法违规、虚假、敏感有害、违反公序良俗、侵犯他人合法权益或其他违反本协议之情况，您不得通过截图、下载、拍照、录像、屏幕捕捉等方式留存相关生成内容，并不得对此进行发送、传播或使用，否则，因您使用生成内容被追责所产生的所有责任，由您自行承担，我们因此产生损失的，有权向您追责。同时，一旦发现您违反本条约定，我们有权不经通知随时对相关信息或生成内容进行删除，并视行为情节对违规账号处以包括但不限于警告、屏蔽、限制或禁止使用部分或全部功能、清空有关内容、账号封禁直至注销的处罚，因此违规造成的损失等后果（包括但不限于数据及相关信息被删除等），由您自行承担，我们不因此而向用户或任何第三方承担任何赔偿责任。
        </b>
      </p>

      <h2>一、关于服务</h2>
      <p class="indent28">
        1、我们向您提供的是AI内容生成产品/服务，该产品/服务通过AI计算，为用户提供图片、视频等内容生成功能，为用户提供灵感具体化的辅助创作工具。
      </p>
      <p class="indent28">
        2、我们仅提供AIGC相关的服务，与AIGC服务有关的设备(如电脑、调制解调器及其他与接入互联网有关的装置)及所需的费用(如为接入互联网而支付的电话费及上网费)等均应由用户自行负担。
      </p>

      <p class="indent28">
        3、
        我们会根据您选择的服务类型向您提供相应的服务。您理解并同意，基于用户体验或产品/服务提供规则及健康发展等综合因素，我们有权选择提供服务或开展合作的对象和范围。
      </p>

      <h2>二、账号获取和使用</h2>
      <p class="indent28">
        您可通过付费购买、接受邀请或参加活动等方式获得我们的服务使用名额。获得服务使用名额后，您需同意《服务协议》的条款并按提示
        <b>向我们提供真实及准确的身份信 息，经核实通过实名认证（如需）后，</b>
        我们将给予您一个用户账号。
        <b>
          如果您所提供的资料或身份信息与事实不符，或您未通过实名认证（如需），导致无法正常使用我们的产品，我们将不承担任何责任。
        </b>
      </p>
      <p class="indent28">
        您知悉并同意，不同类型的产品，我们可能会为您提供不同的账号，不同账号在登录时，将认定为相互独立的账号。
        <b>
          每个账号之间的充值、用户权限、余额、生成内容等无法进行转移、迁徙、转让、赠与、售卖、租借、分享或共同管理，无论该等账户是否由同一主体注册或使用，请您在登录/充值/购买/参加活动时注意区分，避免造成损失。
          由此造成的损失由您自行承担。
        </b>
      </p>

      <p class="indent28">
        <b>
          上述用户账号所有权归我们所有，您仅在服务期限（具体服务期限，以邀请规则、活动规则的规定或您与我们另行协商约定（含口头约定）为准）内拥有账号的使用权。
        </b>
        服务期满后，您的账号将被平台回收，您知悉并同意，除非法律另有规定，平台将全权处置回收的账号。您知悉并同意，服务期限内使用账号进行的全部行为，均是您自行或用户授权其代理人进行的行为，对您均有约束力。
        <b>
          您应当对以其账号进行或发生的所有活动、事件和行为负责（包括但不限于法律责任）。
        </b>
      </p>

      <p class="indent28">
        服务期限内，账号和密码由您自己负责保管。我们将使用通常可以获得的安全技术和程序来保护您的注册资料不被未经授权的访问、使用或泄漏。对于非因我们的疏忽而造成您账号、密码的丢失或您个人资料的泄密，我们不承担任何责任。
      </p>

      <h2>三、服务规则</h2>
      <p class="indent28">
        <b>
          1、您确认并同意，您不得使用我们的产品/服务进行任何违法或不正当的活动，或利用产品/服务为之提供便利，包括但不限于
        </b>
      </p>
      <p class="padding56">a. 反对宪法所确定的基本原则的；</p>
      <p class="padding56">
        b. 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的;
      </p>
      <p class="padding56">c. 损害国家荣誉和利益的；</p>
      <p class="padding56">d. 煽动民族仇恨、民族歧视、破坏民族团结的；</p>
      <p class="padding56">e. 破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
      <p class="padding56">f. 散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
      <p class="padding56">
        g. 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
      </p>
      <p class="padding56">h. 侮辱或者诽谤他人，侵害他人合法权利的；</p>
      <p class="padding56">
        i. 违反中国法律、法规、规章、条例以及任何具有法律效力之规范的
      </p>
      <p class="padding56">
        j. 违反社会公德、公序良俗以及社会主义核心价值观的；
      </p>
      <p class="padding56">k. 以非法民间组织名义活动的；</p>
      <p class="padding56">
        l.
        可能引发未成年人模仿不安全行为和违反行为、诱导未成年人不良嗜好等损害未成年人身心健康的；
      </p>
      <p class="padding56">
        m. 散布商业广告，或类似的商业招揽信息、过度营销信息及垃圾信息的。
      </p>
      <p class="padding56">
        n.从事网络炒作、恶意发帖跟评、编写恶意软件，实施不正当的商业营销等；
      </p>
      <p class="padding56">o.利用算法、数据、平台等优势实施不公平竞争；</p>
      <p class="padding56">
        p.为任何其他非法目的而使用本产品及相关服务；或以任何形式侵犯平台的商业利益。
      </p>
      <p class="indent28">
        <b>
          2、
          2、您保证，您使用AIGC产品/服务，应尊重和维护我们以及其他第三方的合法权
          益，不得直接或间接进行包括但不限于如下活动：
        </b>
      </p>
      <p class="padding56">
        a.破坏或试图破坏我们的产品/服务或平台任何部分或功能的正常运行；
      </p>
      <p class="padding56">
        b.对本产品及相关服务或与其相关的任何网站、程序等产品或内容进行出租、出借、复制、信息网络传播、修改、链接、转载、汇编、发表、出版、建立镜像站点等；或进行逆向工程、反编译、反汇编等；
      </p>
      <p class="padding56">
        c.删除、隐藏、修改产品/服务上显示或其中包含的任何专利、版权、商标或其他权利声明；
      </p>
      <p class="padding56">
        d.避开、尝试避开或声称能够避开任何内容保护机制或者产品/服务数据度量工具；
      </p>
      <p class="padding56">
        e.向任何第三方以任何形式提供本服务条款项下服务，包括但不限于提供账号让其使用、转售、转租或转赠产品/服务；
      </p>
      <p class="padding56">
        f.冒充用户或者以任何形式通过他人的账号访问、登录、使用我们的服务/产品。
      </p>
      <p class="padding56">
        g.未事先经过原始用户的同意，而向任何非原始用户显示或以其他方式提供任何用户信息；
      </p>
      <p class="padding56">
        h.对产品/服务及其相关信息内容的源网页、来源说明、服务提供主体等信息进行任何形式的改动、隐藏、删除、遮挡、虚假说明，或通过插入、弹窗等任何形式妨碍信息展示。
      </p>

      <p class="indent28">
        <b>
          3、您使用行者AIGC产品/服务，须维护互联网秩序和安全，不得实施包括但不限于以下行为，也不得为任何破坏互联网秩序和安全的行为提供便利：
        </b>
      </p>
      <p class="padding56">
        a. 未经允许，进入计算机信息网络或者使用计算机信息网络资源的；
      </p>
      <p class="padding56">
        b.未经允许，对计算机信息网络功能或计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或增加的；
      </p>
      <p class="padding56">
        c.以病毒、木马、恶意代码、钓鱼等方式，对网站、服务器进行恶意扫描、非法侵入、非法获取数据等；
      </p>
      <p class="padding56">
        d.实施任何试图改变产品/服务或产品/服务涉及的第三方软件的系统配置或破坏系统安全的；
      </p>
      <p class="padding56">
        e.以任何方式攻击或破坏平台、系统及服务器的正常运行；
      </p>
      <p class="padding56">f.其他危害计算机信息网络安全的行为。</p>

      <p class="indent28">
        <b>4、您应保证您使用AIGC产品/服务生成的所有内容：</b>
      </p>
      <p class="padding56">
        a.不得含有颠覆国家政权、推翻社会主义制度，煽动分裂国家、破坏国家统一，宣扬恐怖主义、极端主义，宣扬民族仇恨、民族歧视，暴力、淫秽色情信息，虚假信息，以及可能扰乱经济秩序和社会秩序的内容；
      </p>
      <p class="padding56">
        b.不得含有种族歧视、国别歧视、性别歧视等歧视性的内容；
      </p>
      <p class="padding56">
        c.生成内容应当真实准确，不得散播虚假信息，尤其是虚假新闻消息；
      </p>
      <p class="padding56">
        d.不得利用生成内容损害他人形象、名誉以及其他合法权益，不得进行商业炒作、不正当营销。
      </p>
      <p class="indent28">
        如您利用我们的产品/服务提供互联网新闻信息服务的，应当依法取得互联网新闻信息服务许可，规范开展互联网新闻信息采编发布服务、转载服务和传播平台服务，不得生成合成虚假新闻信息，不得传播非国家规定范围内的单位发布的新闻信息。您利用我们的产品/服务开展其他业务的，您亦需要获得业务相关的全部资质和许可。
      </p>
      <p class="indent28">
        <b>
          5、我们有权根据有关法律规定，根据信息内容的实际情况，对您利用我们的产品/服务生成或编辑的内容添加标识或显著标识。您亦可以根据我们的指示在有关内容中添加显著标识。请您知悉，您或您的终端用户、合作方或任何第三方，均不可采用技术手段删除、篡改、隐匿我们添加的标识。
        </b>
      </p>

      <p class="indent28">
        <b>
          6、对您向我们提供的任何素材、数据或信息（包括但不限于预训练数据，以下统称“数据”），您应保证：
        </b>
      </p>

      <p class="padding56">
        a.符合《网络安全法》等法律法规的要求；不含有侵犯知识产权的内容；
      </p>
      <p class="padding56">
        b.数据包含个人信息的，您已经征得个人信息主体同意或者符合法律、行政法
        规规定的其他情形；
      </p>
      <p class="padding56">c.您确保数据的真实性、准确性、客观性、多样性；</p>
      <p class="padding56">
        d.数据符合国家网信部门关于生成式人工智能服务的其他监管要求；
      </p>
      <p class="padding56">
        e.如您使用产品/服务涉及人脸、人声等生物识别信息编辑功能的，您应当依
        法告知被编辑的个人，并取得其单独同意。
      </p>
      <p class="indent28">
        7、尽管有上述约定，您进一步确认并保证，您使用本服务/产品过程中所制作、生
        成、复制、发布、传播、上传的任何内容（包括但不限于您的昵称、头像、用户签名等
        注册信息及认证资料，您使用服务过程中向我们提供或上传的信息、您输入的数据，
        您通过使用产品/服务生成的内容，以及您使用我们其他服务所产生、发布、或展示的
        其他内容，您通过文字、语音、图片、视频等任何形式进行发布、评论、回复等互动而
        形成的信息以及相关链接页面等。前述内容以下也称“信息内容”）不得具有误导性或
        非法性，
        <b>
          不会违反法律法规的规定以及本协议约定，也不会侵犯其他
          用户或第三方合法权益（包括但不限于专利权、商标权、著作权及著作权邻接权、肖像
          权、隐私权、名誉权等）。同时，您承诺并保证，就前述信息内容，你不得自行或授权、
          允许、协助他人对进行如下行为：
        </b>
      </p>

      <p class="padding56">a.未经许可或同意，擅自上传、提供或使用他人作品；</p>
      <p class="padding56">
        b.使用或利用我们的产品/服务制作、生成、复制、发布、传播、上传、分享
        违反本协议约定的信息内容；
      </p>
      <p class="padding56">
        c.利用基于深度学习、虚拟现实等新技术新应用制作、发布、传播虚假信息（您
        在发布或传播利用基于深度学习、虚拟现实等新技术新应用制作的非真实信
        息时，应当以显著方式予以标识）；
      </p>
      <p class="padding56">
        d.擅自复制、读取、采用行者AIGC产品及相关服务的信息内容，用于包括但
        不限于宣传、增加阅读量、浏览量等商业用途；
      </p>
      <p class="padding56">
        e.采用包括但不限于特殊标识、特殊代码等任何形式的识别方法，自行或协助
        第三人对行者AIGC产品及相关服务的信息内容产生流量、阅读量引导、转
        移、劫持等不利影响；
      </p>
      <p class="padding56">
        f.以任何方式（包括但不限于盗链、冗余盗取、非法抓取、模拟下载、深度链
        接、假冒注册等）非法获取信息内容，或以任何方式（包括但不限于隐藏
        或者修改域名、平台特有标识、用户名等）删除或改变相关信息内容的权利
        管理电子信息（如有）。
      </p>
      <p class="padding56">g.以任何其他方式非法获取、使用或传播信息内容。</p>
      <p class="indent28">
        8、您知悉并同意，对于您制作、复制、发布、传播、上传、分享、生成的信息内
        容，我们有权采取技术手段或人工方式加以审核，并对敏感信息进行过滤。同时，我们
        有权通过模型优化等方式防止敏感违规内容得再次生成。
      </p>
      <p class="indent28">
        任何用户发现其他用户利用行者AIGC制作、复制、发布、传播、上传、分享的内
        容涉嫌侮辱或者诽谤他人、侵害他人合法权益的或违反本协议的，有权直接联系我们或
        通过我们设置的投诉举报入口对违规用户进行投诉；我们将及时受理、处理并反馈处理
        结果。
      </p>

      <p class="indent28">
        9、如您应用我们的产品/服务向您的终端用户提供信息的，您应遵守有关法律法规
        （包括但不限于《互联网信息服务算法推荐管理规定》）的规定，合规使用产品/服务，
        保护终端用户个人信息，维护终端用户知情权、选择权等合法权益，尤其需依法维护未
        成年人、消费者、老年人、消费者等群体的特殊权益。
      </p>

      <p class="indent28">
        10、在使用产品/服务的过程中，如用户发现任何可能侵害自己或平台权益的事实
        时，应及时通知我们并提供相应的证明材料。因投诉不实给我们或第三方造成损失的，
        用户应承担法律责任。
      </p>

      <p class="indent28">
        11、您在使用本产品/服务某一特定服务时，该服务可能会另有单独的协议、相关
        业务规则等，您在使用该项服务前请阅读并同意相关的协议；您使用前述特定服务，即
        视为您接受相关单独协议。单独协议与本协议不一致的，以单独协议约定为准；单独协
        议未涉及的内容，仍按本协议约定执行。
      </p>
      <p class="indent28">
        12、您个人操作导致出错的任何结果，由您自行负责，我们不给予任何形式的赔偿。
        由于您授权第三方（包括第三方应用）访问/使用其本服务所导致的纠纷或损失，也应
        由您自行承担。
      </p>
      <p class="indent28">
        13、如您涉嫌违反本协议或相关服务条款的规定，我们有权依合理判断对违反有关
        法律法规或本协议规定的行为进行处理和追责，并对违法违规的任何用户采取适当的法
        律行动，您应独自承担由此而产生的一切法律责任。
        <b>
          若我们依照本协议及相关业务规则
          限制、冻结或终止您的账号使用，可能会导致您账号的数据及相关信息被删除，以及相
          关权益的丧失，该损失由您自行承担，对此我们不承担任何责任。
        </b>
      </p>
      <p class="indent28">
        14、如果我们发现或收到他人举报或投诉您或相关信息内容涉嫌违反本协议约定的，
        <b>
          我们有权不经通知随时对相关信息内容进行删除，并视行为情节对违规账号处以包括但
          不限于警告、屏蔽、限制或禁止使用部分或全部功能、暂停使用、清空有关内容、账号
          封禁直至注销的处罚，您未使用的费用、虚拟财产等，将直接作为违约金归我们所有，
          前述违约金不足弥补我们损失的，还有权要求您继续承担赔偿责任；情节严重者，还将
          进一步追究法律责任。因此违规造成的损失等后果（包括但不限于数据及相关信息被删
          除等），由您自行承担，我们不因此而向用户或任何第三方承担任何赔偿责任。
        </b>
      </p>

      <p class="indent28">
        15、在我们调查相关争议事实时，您有义务就相关事实在我们要求的时间内向我们
        合理解释并充分举证证明。如您既不做出合理解释又不进行任何举证，也不采取任何有
        效止损行为（如需），我们将可能结合您该种消极应对态度认定您构成违约并采取相应
        救济措施。
      </p>

      <p class="indent28">
        16、
        <b>
          如您在使用产品/服务过程中发生下列任何一种情形，我们有权随时中断或终止向用户提供产品/服务（包括收费网络服务）而无需对您或任何第三方承担任何责任（包括退款或赔偿责任，下同）：
        </b>
      </p>
      <p class="padding56">a.违反法律法规的；</p>
      <p class="padding56">
        b.违反本协议、单独协议或产品/服务/平台适用的其他规定的；
      </p>
      <p class="padding56">c.您相关的信息内容涉嫌违约或侵权的；</p>

      <p class="padding56">d.提供的个人资料或所作陈述、承诺不真实的；</p>

      <p class="padding56">e.影响使用者体验且经平台告知拒不改正的；</p>
      <p class="padding56">f.存在安全隐患且经平台告知拒不改正的；</p>
      <p class="padding56">g.侵犯平台及/或其他第三方的合法权利/权益时</p>
      <p class="padding56">h.违背平台运营原则，或不符合平台其他管理要求的。</p>
      <p class="indent28">
        17、如果我们发现或收到他人举报或投诉您或相关信息内容涉嫌违反本协议约定或
        违法法律规定的，我们将根据法律规定采取消除等处置措施，保存有关记录，并向网信
        部门以及有关主管部门报告，
        <b>
          因此造成的损失等后果（包括但不限于被主管机关处罚等），
          由您自行承担，我们不因此而向用户或任何第三方承担任何赔偿责任。如我们因此遭受
          损失的，您应赔偿我们的全部损失。
        </b>
      </p>

      <p class="indent28">
        18、您对信息内容以及您使用服务而导致的任何作为或不作为承担全部责任。您理
        解并同意，因您信息内容以及您的行为（包括作为或不作为、履行或违约行为）导致或
        产生第三方主张的任何索赔、要求或损失，或者导致政府部门的处罚，您应当独立承担
        责任；如我们或与我们合作的其他单位因此面临任何投诉、举报、质询、索赔、诉讼、
        处罚或因此遭受任何名誉、声誉或者财产上损失的，
        <b>
          您应积极地采取一切可能采取的措
          施，以保证我们及与我们合作的其他单位免受上述索赔、诉讼的影响。同时您对我们
          及与我们合作的其他单位因此遭受的直接及间接经济损失（包括但不限于我们因此而支
          付的赔偿金/补偿金、商誉损失、预期可得利益、差旅费、打印费、餐饮住宿费、通讯
          费、公证费、公告费、财产保全费、律师费、案件受理费、税费等）负有全部的损害赔
          偿责任。
        </b>
      </p>

      <h2>四、资费政策</h2>
      <p class="indent28">
        1、我们有权决定我们所提供的产品的资费标准和收费方式，我们可能会就不同的
        产品模式制定不同的资费标准和收费方式，也可能按照我们所提供的产品的不同阶段确
        定不同的资费标准和收费方式。
        <b>
          具体计费方式、收费标准和支付方式以邀请规则、活动
          规则的规定或您与我们另行协商约定（含口头约定）为准，请您使用服务前仔细确认相
          关约定或规定。
        </b>
      </p>
      <p class="indent28">
        2、我们可能根据实际需要对收费服务或功能的范围、收费服务的点数规则或其他规则（如有）、收费标准、方式进行修改和变更。前述修改、变更或开始收费前，我们将在相应服务页面进行通知或公告。
        <b>如果您不同意上述修改、变更或付费内容，则应停止使用该服务。</b>
      </p>
      <p class="indent28">
        3、用户选购某一特定服务类型时，该服务可能会有单独的采购协议或销售协议，
        <b>您在购买服务前请务必阅读并同意相关的协议；</b>
        您购买相关特定服务，即视为您接受相关的单独协议。
      </p>
      <p class="indent28">
        4、对于我们的收费产品和服务，用户应该按照我们确定的资费政策购买我们的产品和服务。如果用户未按我们确定的资费政策购买我们的产品和服务，
        <b>我们可以立即停止向用户提供该产品和服务。</b>
      </p>

      <h2>五、广告</h2>
      <p class="indent28">
        1、您知晓并同意，我们可以在我们提供服务及产品上为其他方发布商业广告或其它活动促销的广告。
      </p>
      <p class="indent28">
        2、
        需要注意的是，这些内容系广告商或商品服务提供者所为，我们仅为提供发布的媒介。您如通过我们或我们所链接的网站进行购买服务或商品，该交易行为仅存于您与该商品或服务的提供者之间，与我们无关。
      </p>
      <h2>六、隐私和数据保护</h2>
      <p class="indent28">
        1、我们承诺对用户在使用我们服务时所提供的个人信息实行隐私保护。除本协议另有规定外，我们将遵循本条规定。
      </p>
      <p class="indent28">
        2、我们会收集由用户在自主意愿下所填写、传送、输入、上传并愿意由我们所使用的资料。例如：姓名、地址、电子邮件信箱等项目，以及用户使用服务/产品中产生的信息内容。使用方式包括不限于利用资料来了解用户对我们的意见与看法，或参加在我们推广的各项活动等等。
      </p>
      <p class="indent28">
        3、您确认并同意，为服务用户，我们可能会使用用户自身的数据及用户向我们提供的数据。除产品本身的功能外，服务内容还可能包括但不限于向用户发出产品和服务信息（例如促销、会议、活动动态、最近市场活动等等）等等。
      </p>
      <p class="indent28">
        4、保护用户隐私是我们的一项基本政策，未经用户许可，我们不会擅自披露用户数据给任何我们及我们关联公司以外的其他方。但在下述情况下，我们可能部分或全部披露用户数据：
      </p>

      <p class="padding56">a.经用户同意，向第三方披露；</p>
      <p class="padding56">
        b.根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司
        法机构披露；
      </p>
      <p class="padding56">
        c.如果用户出现违反中国有关法律法规的情况，需要向第三方披露；
      </p>
      <p class="padding56">
        d.为提供用户所要求的产品或服务，而必须和第三方分享用户数据。
      </p>
      <p class="indent28">
        5、您认可并同意，在不透露单个用户隐私资料的前提下，我们有权对整个用户的数据库进行分析并对用户数据库进行商业上的利用。
      </p>

      <p class="indent28">
        6、请您放心，我们将尽商业上合理的努力，遵循不低于普遍接受的行业标准以及
        相关法律法规要求，以保护您数据的安全性、机密性和完整性。我们采取的安全措施包
        括：(i)严格控制第三方对客户数据的访问权限；(ii)以加密方式存储和传输客户的
        数据；(iii)制定严格的数据安全管理流程。除非本协议或隐私权政策另有约定，我们
        不会向任何第三方提供您的服务数据。
      </p>

      <p class="indent28">
        <b>
          7、你知悉并同意，除非法律另有规定，对于您在本协议项下有关服务/产品中的服
          务数据或您因使用本协议项下服务而存储于服务器中的数据等信息，我们将仅保留1个
          月（自数据产生之日起算），到期服务系统将自动删除所有数据且数据将无法恢复，请
          您及时下载并保存备份。您理解并同意，数据存储需消耗大量服务器资源，我们仅在前
          述期限内进行保存，如您需延长存储期限，您需另行支付费用，具体费用标准，请咨询
          我们的客服。
        </b>
      </p>
      <h2>七、知识产权</h2>
      <p class="indent28">
        1、除非另行说明，我们保留对以下各项内容、信息完全的、不可分割的（包括但
        不限于）所有权、知识产权和/或其他合法权益，非经我们允许，您不得擅自使用：
      </p>
      <p class="padding56">
        a.产品和/或服务及其所有元素，包括其所有的内容、数据、技术、软件、代码、用户界面、商标、logo等商业标识以及与其相关的任何衍生作品；
      </p>
      <p class="padding56">
        b.平台以及我们名称的文字、图形及其组合，以及平台的代码、其他标识、徽记、名称、技术文档等；
      </p>
      <p class="padding56">
        c.用户向行者AIGC产品/服务提供的与该服务相关的任何信息及反馈。
      </p>

      <p class="indent28">
        未经本我们同意或协议另有明确约定，上述内容均不得在任何媒体直接或间接发布、
        播放、出于播放或发布目的而改写或再发行，或者被用于其他任何商业目的。我们不就
        由上述内容产生或在传送或递交全部或部分上述内容过程中产生的延误、不准确、错误
        和遗漏或从中产生或由此产生的任何损害赔偿，以任何形式向用户或任何第三方负法律、
        经济责任。
      </p>

      <p class="indent28">
        2、我们给予您一项个人的、不可转让及非排他性的许可，以使用产品/服务。您可以根据本协议约定进行使用、显示、运行。
      </p>
      <p class="indent28">
        3、您声明并保证您对您在我们的网站上发布或以其他方式提供的内容拥有合法所有权、知识产权或充分授权，并就相关内容全权担责。
      </p>
      <p class="indent28">
        4、就您使用产品/服务生成的所有内容，相关知识产权为您本人所有，您可进行合理使用。
      </p>
      <p class="indent28">
        5、您理解并且同意，为持续改善我们为您提供的各项服务，您在使用服务过程中
        所制作、生成、复制、发布、上传、传播的任何内容，我们均拥有在全世界范围内永久
        性的、免费的和可再许可的权利，我们可以使用、复制、修改、改编、出版、翻译、据
        以创作衍生作品、传播、表演和展示该等内容的全部或部分，或进行商业开发；和/或
        将此等内容的全部或部分编入其他任何形式的作品、媒体或技术中。
      </p>
      <p class="indent28">
        6、就您在使用服务过程中所发布、上传、传播或展示的任何内容，您知悉并同意，您的内容可被其他人查看、下载，您授予每位用户永久的、不可撤销的、全球性的、免版税的、非排他性的许可，允许他们通过我们的服务和功能使用、展示、发布、复制、分发您的内容并制作衍生作品。您同意，您从我们或其他用户处下载、访问或使用的任何内容均由您自行承担风险，并受这些条款和/或此类内容随附条款的约束。
      </p>
      <p class="indent28">
        7、你同意并特此授权我们为宣传、推广的目的合理使用您的下述信息内容：(i)您
        通过产品/服务生成且经您授权公开（如需）的作品；(ii)您在使用服务过程中所复制、
        发布、上传、传播的信息内容；(iii)您的名称、商标或标识等信息。
      </p>
      <p class="indent28">
        8、本协议其他条款未明示授权的其他一切权利仍由我们保留，您在行使这些权利时须另外取得我们的书面许可。
      </p>
      <p class="indent28">
        9、任何组织或个人认为平台内容，如平台内的设计图片、Logo等可能侵犯其合法
        权益的，可联系我们工作人员，我们将在收到知识产权权利人合格通知后依法尽快处理。
      </p>
      <h2>八、第三方服务</h2>
      <p class="indent28">
        1、本产品/服务可能会使用/调用第三方软件、服务或技术（包括可能使用的开源代码和公共领域代码等，下同），或通过第三方支持用户的使用和访问，
        <b>
          我们不保证通
          过第三方提供服务及内容的安全性、准确性、有效性及其他不确定的风险，由此若引发
          的任何争议及损害，应由该第三方负责解决，与我们无关，我们不承担任何责任。
        </b>
        我们不对第三方软件或技术提供客服支持，若您需要获取支持，请与第三方联系。
      </p>
      <p class="indent28">
        2、如本产品/服务使用了第三方的软件、产品服务或技术，您在使用本产品/服务中由第三方提供的软件、技术或服务时，您应当遵守这些协议与要求。
        <b>
          如果您没有遵守，该第三方或者国家机关可能会对您提起诉讼、罚款或采取其他制裁措施，并要求我们给予协助，您应当自行承担法律责任。
        </b>
      </p>
      <p class="indent28">
        3、用户可能在使用我们的产品过程中链接到第三方的站点。第三方的站点不由我们控制，并且我们也不对任何第三方站点的内容、第三方站点包含的任何链接、或第三方站点的任何更改或更新负责。我们仅为了提供便利的目的而向用户提供这些到第三方站点的链接，我们所提供的这些链接并不意味着我们认可该第三方站点。用户需要检查并遵守该第三方站点的相关规定。
      </p>
      <h2>九、免责声明</h2>
      <p class="indent28">
        <b>
          1、对您使用AIGC产品/服务，我们不作任何明示或暗示的保证，包括但不限于：
        </b>
      </p>

      <p class="padding56">a.本产品/服务满足用户的使用需求或符合用户的期限；</p>
      <p class="padding56">
        b.本产品/服务的适销性、适用性、及时性、可靠性、准确性、完整性、无病
        毒以及无错误；
      </p>
      <p class="padding56">c.本产品/服务的持续提供；</p>
      <p class="indent28">
        <b>
          2、您同意使用我们提供的服务是出于您的个人意愿，并愿自负任何风险。前述风
          险包括但不限于：您因执行我们所提供的服务或网站下载资料而导致您或您所使用的计
          算机系统受到损害或发生任何资料的流失；您因对服务内容的合法性、正确性、完整性
          或实用性的依赖而遭受的损失；网络信号不稳定、无线网络带宽小等原因，所引起的账
          号登录失败、资料同步不完整、页面打开速度慢等。
        </b>
      </p>
      <p class="indent28">
        <b>
          3、对于因电信系统或互联网网络故障、因我们、我们的合作方或电信网络系统软
          硬件设备的故障、失灵或人为操作的疏失、因计算机故障或病毒、因信息损坏或丢失、
          因他人侵入我们的网络或游戏系统、因他人篡改、删改或伪造、变造产品/服务或网站
          数据或因其它任何不可抗力原因而产生的损失，我们不承担任何责任，但我们会尽力减
          少因此而给用户造成的损失和影响。
        </b>
      </p>

      <p class="indent28">
        4、鉴于网络服务的特殊性，用户同意我们根据业务发展情况随时随时变更、中断
        或终止产品/服务部分或全部的网络服务。如变更、中断或终止的网络服务属于免费网
        络服务，
        <b>我们无需通知用户，也无需对用户或任何第三方承担任何责任。</b>
      </p>

      <p class="indent28">
        5、您理解，我们需要定期或不定期地对提供网络服务的平台或相关的设备进行检
        修或者维护，如因此类情况而造成收费网络服务中断，
        <b>
          我们无需为此对用户或任何第三
          方承担任何责任，但我们将尽可能事先进行通告。
        </b>
      </p>

      <p class="indent28">
        6、我们可在任何时候为任何原因变更本服务或删除其部分功能，且可在任何时候
        取消或终止对用户的服务。我们取消或终止服务的决定不需要理由或通知用户。一旦服
        务取消，用户使用本服务的权利立即终止。
        <b>
          一旦本服务取消或终止，用户在本服务中储
          存的任何信息将无法恢复，我们无需就此对用户或任何第三方承担任何责任。
        </b>
      </p>
      <p class="indent28">
        <b>7、考虑到法律法规及政策变化等原因，</b>
        原因，我们有权增设、制定、修改或更新我们关
        于算法机制机理审核、科技伦理审查、信息发布审核、数据安全、个人信息保护、反电
        信网络诈骗、应急处置等的管理制度，并根据最新管理制度对您使用我们服务/产品的
        行为、活动以及相关信息内容进行审查或处理，我们会尽量降低因此对您造成的不利影
        响，但您知悉并同意，如因此此类情况而造成服务/产品/信息内容的暂停、调整或删改，
        <b>我们无需为此对用户或任何第三方承担任何责任。</b>
      </p>
      <p class="indent28">
        8、考虑到法律法规及政策变化等情况，我们保留对所提供服务内容、功能、方式、
        规则以及本协议条款等内容进行修正、变化或调整的权利，如果您不接受修改后的内容，
        请立即停止使用我们的产品，您继续使用我们提供的产品将被视为您已接受了修改后的
        内容。
      </p>
      <p class="indent28">
        9、您理解并同意，即使我们的产品/服务存在瑕疵，但上述瑕疵是当时行业技术水
        平所无法避免的，其将不被视为我们违约，我们也无需承担任何责任。
      </p>
      <p class="indent28">
        10、在任何情况下，对您因使用或不能使用服务所产生的任何间接的、偶然的、特
        殊的或惩罚性的损害及损失，包括预期利润的丧失、机会损失、声誉/商誉损害、贸易
        中断、商业信息的丢失等，我们不承担责任。
      </p>
      <p class="indent28">
        11、在任何情况下，我们的最大赔偿责任不超过违约服务对应之服务费用总额。若
        本条款与双方其他约定或其他服务规则冲突或不一致的，以本条约定为准。
      </p>

      <h2>十、法律适用及争议解决</h2>
      <p class="indent28">1、本协议适用中华人民共和国法律。</p>
      <p class="indent28">
        2、因本协议引起的或与本协议有关的任何争议，各方应友好协商解决；协商不成的，
        <b>何一方均可将有关争议提交至服务提供方所在地的人民法院诉讼解决。</b>
      </p>
      <h2>十一、其他</h2>
      <p class="indent28">
        1、如果本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，或违反任何适用的法律，则该条款被视为删除，但本协议的其余条款仍应有效并且有约束力。
      </p>
      <p class="indent28">
        2、本协议的标题仅为方便阅读所设，非对条款的定义、限制、解释或描述其范围或界限。
      </p>
      <p class="indent28">
        3、本协议自发布之日起实施，并构成您和我们之间的共识。我们不行使、未能及
        时行使或者未充分行使本服务条款或者按照法律规定所享有的权利，不应被视为放弃该
        权利，也不影响我们在将来行使该权利。
      </p>

      <p class="indent28">
        4、如您在使用服务过程中有任何问题或对本协议的相关事宜有任何意见或建议，
        请联系我们的客服。
      </p>
    </div>
  </main>
</div>
